{
    "format": "graph-model",
    "generatedBy": "2.11.0",
    "convertedBy": "TensorFlow.js Converter v4.2.0",
    "signature": {
        "inputs": {
            "token_type_ids:0": {
                "name": "token_type_ids:0",
                "dtype": "DT_INT32",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "-1"
                        }
                    ]
                }
            },
            "attention_mask:0": {
                "name": "attention_mask:0",
                "dtype": "DT_INT32",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "-1"
                        }
                    ]
                }
            },
            "input_ids:0": {
                "name": "input_ids:0",
                "dtype": "DT_INT32",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "-1"
                        }
                    ]
                }
            },
            "segment_ids:0": {
                "name": "segment_ids:0",
                "dtype": "DT_INT32",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "1"
                        },
                        {
                            "size": "-1"
                        }
                    ]
                }
            },
            "input_mask:0": {
                "name": "input_mask:0",
                "dtype": "DT_INT32",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "1"
                        },
                        {
                            "size": "-1"
                        }
                    ]
                }
            },
            "global_step:0": {
                "name": "global_step:0",
                "dtype": "DT_INT32",
                "tensorShape": {}
            }
        },
        "outputs": {
            "Identity_1:0": {
                "name": "Identity_1:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "-1"
                        }
                    ]
                }
            },
            "Identity:0": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "-1"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "tf_bert_for_question_answering_1/split/split_dim",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/qa_outputs/Tensordot/Const",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/qa_outputs/Tensordot/axes",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/qa_outputs/Tensordot/GatherV2_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/qa_outputs/Tensordot/Const_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/qa_outputs/Tensordot/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    },
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/LayerNorm/batchnorm/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/Const",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/axes",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/GatherV2_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/Const_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3072"
                                    },
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/Gelu/mul/x",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/Gelu/add/x",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/Const",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/axes",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/GatherV2_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/Const_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    },
                                    {
                                        "size": "3072"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/free",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/GatherV2/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/Const_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/Tensordot/concat_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/dense/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3072"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "ConstantFolding/tf_bert_for_question_answering_1/bert/encoder/layer_._11/intermediate/Gelu/truediv_recip",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/free",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/GatherV2/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/Const_2",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/Tensordot/concat_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/output/dense/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/output/LayerNorm/batchnorm/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/output/dense/Tensordot/Const",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/output/dense/Tensordot/axes",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/output/dense/Tensordot/GatherV2_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/output/dense/Tensordot/Const_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/output/dense/Tensordot/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    },
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/Const",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/axes",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/GatherV2_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/Const_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    },
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/free",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/GatherV2/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/Const_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/Tensordot/concat_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/query/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/Reshape_2/shape/1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/Reshape_2/shape/2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/Reshape_2/shape/3",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/transpose_2/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "4"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/Const",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/axes",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/GatherV2_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/Const_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    },
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/free",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/GatherV2/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/Const_2",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/Tensordot/concat_1/axis",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/key/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "768"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/Reshape/shape/1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/Reshape/shape/2",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/Reshape/shape/3",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/transpose/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "4"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "ConstantFolding/tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/truediv_recip",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/add_1/y",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/value/Tensordot/Const",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "tf_bert_for_question_answering_1/bert/encoder/layer_._11/attention/self/value/Tensordot/axes",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
